Autodesk.Revit.DB.IModelExportContext.OnPoint(Autodesk.Revit.DB.PointNode)
This method is called when a Point is being output.
Remarks:
Note that this method is invoked only if the custom exporter
was set up to include geometric objects in the output stream.
See Autodesk.Revit.DB.CustomExporter.IncludeGeometricObjects for mode details.
node:
An output node that represents a Point.
Returns:
Return RenderNodeAction.Proceed if you wish to receive low-level geometry
(line segments) for this point, or otherwise return RenderNodeAction.Skip.
Since:
2016